# RampMaxRunLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RampMaxRunLength Property
ParameterTypeId Class See Also
---
"Maximum Incline Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RampMaxRunLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RampMaxRunLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RampMaxRunLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace